---
kind: type
id: T:Autodesk.Revit.DB.Architecture.RailingPathCurveJoinOption
source: html/bf5d6c5a-02db-6fba-973d-df9a5f3bc5d7.htm
---
# Autodesk.Revit.DB.Architecture.RailingPathCurveJoinOption

The join type of the railing path.

## Syntax (C#)
```csharp
public enum RailingPathCurveJoinOption
```